frontend/controllers/ProfileController.php

SELECT * FROM `profile` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Profile::findOne($id)) !== null) {