common/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status_id' =>
            self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`id`=2) AND (`status_id`=10)